#### LinkedConnector Property

---

|  |
| --- |
| MEPConnectorInfo Class   See Also |

The linked connector or    a null reference (  Nothing  in Visual Basic)  if there is no linked connector

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 16.0.0.0 (16.0.0.0)
  **Since:**  2016

# Syntax

| C# |
| --- |
| ``` public Connector LinkedConnector { get; } ``` |

| Visual Basic |
| --- |
| ``` Public ReadOnly Property LinkedConnector As Connector 	Get ``` |

| Visual C++ |
| --- |
| ``` public: property Connector^ LinkedConnector { 	Connector^ get (); } ``` |

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions DisabledDisciplineException | None of the following disciplines is enabled: Mechanical Electrical Piping. |

# See Also

MEPConnectorInfo Class

Autodesk.Revit.DB Namespace